{
  "backend/main.mo": "Motoko canister that configures baseline coin values and processes coin condition metrics to return grade estimation, value breakdown, and a status message.",
  "feature_evidence.json": "Feature evidence report describing camera permission‑flow updates and the related frontend file.",
  "frontend-file-summaries.txt": "Prewritten summaries for all frontend files covering components, hooks, utilities, and styles.",
  "frontend/index.css": "Global Tailwind‑based style variables and theming for light and dark modes.",
  "frontend/index.html": "Root HTML document bootstrapping the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component rendering the header, grading flow, and footer.",
  "frontend/src/components/Brand/AppHeader.tsx": "Header displaying the app logo, title, and subtitle.",
  "frontend/src/components/Brand/HeroBackdrop.tsx": "Wrapper component adding a low‑opacity hero background image behind its children.",
  "frontend/src/components/CoinCapture/CapturePreview.tsx": "Preview screen showing the captured image with retake and continue actions.",
  "frontend/src/components/CoinCapture/CaptureTips.tsx": "Alert listing best‑practice tips for photographing coins.",
  "frontend/src/components/CoinCapture/CoinCameraCapture.tsx": "Camera‑capture component with gesture‑based camera start, permission/error handling, capture controls, and upload fallback.",
  "frontend/src/components/CoinCapture/CoinGradingFlow.tsx": "Main state machine coordinating capture method selection, preview, metadata entry, analysis, and results handling.",
  "frontend/src/components/CoinCapture/FlowFallbackErrorCard.tsx": "Displays an error card when the analysis flow enters an invalid state and offers a restart button.",
  "frontend/src/components/CoinCapture/ImageUploadPicker.tsx": "Provides a UI card for selecting an image file and triggers callbacks for file selection or canceling.",
  "frontend/src/components/Metadata/CoinMetadataForm.tsx": "Renders a metadata entry form with validation, error handling, and submit/back controls for coin details.",
  "frontend/src/components/Results/AnalysisResult.tsx": "Shows success, error, or fallback result views for coin analysis, including the image and metadata summary.",
  "frontend/src/components/Results/EstimateDisclaimer.tsx": "Displays a disclaimer explaining limitations of automated grade and value estimates.",
  "frontend/src/components/Results/SubmittedMetadataSummary.tsx": "Shows a compact summary of submitted coin metadata including optional mint mark and notes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useCoinAnalysis.ts": "Handles the coin analysis workflow, including preprocessing, feature extraction, backend calls, and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, managing login flow, stored identities, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base layers and a warm metallic color theme with light/dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/types/coin.ts": "Defines TypeScript interfaces for coin metadata and analysis result/valuation fields.",
  "frontend/src/utils/coinImageHeuristics.ts": "Implements client‑side image feature extraction and heuristics for sharpness, contrast, and edge clarity.",
  "frontend/src/utils/imagePreprocess.ts": "Resizes and compresses images client‑side before analysis and returns a processed File.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins.",
  "project_state.json": "Stores project state, feature requirements, issues, and architectural notes for the coin‑grading app."
}